<center> <img src = https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/HeadHunter_logo.png/480px-HeadHunter_logo.png alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [7]:
import pandas as pd 
import psycopg2

In [8]:
DBNAME = 'project_sql'
USER = 'amanat'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [9]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Предварительный анализ данных

1. Запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [10]:
query_3_1 = f'''select *
           from vacancies 
        ''' # делаем первый запрос 
vacancies = pd.read_sql_query(query_3_1, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_3451/1777358714.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancies = pd.read_sql_query(query_3_1, connection)

In [11]:
vacancies

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
...,...,...,...,...,...,...,...,...,...,...
49192,55589514,Специалист по информационным технологиям,Электронный документооборот\t1С: Предприятие 8...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,66,5109332
49193,55029668,Руководитель процессного офиса,Оптимизация бизнес-процессов\tСтратегическое м...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,26,51333
49194,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
49195,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939
49196,55547842,DataOps Engineer,None,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,4978627

In [61]:
vacancies.shape[0] # количество строк датасета вакансий

49197

2. Запрос, который посчитает количество работодателей (таблица employers).

In [12]:
query_3_1 = f'''select *
           from employers
        '''
employers = pd.read_sql_query(query_3_1, connection) # датасет работадателей

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_3451/2554144186.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers = pd.read_sql_query(query_3_1, connection) # датасет работадателей

In [13]:
employers

            id                                               name  area
0         2393                   Программный Продукт, ИТ-компания     1
1        72977                                          БАРС Груп    88
2         3155  Бест, Торгово-производственная компания, Екате...     3
3          675                                   КОРУС Консалтинг     2
4      1840010  филиал ФКУ Налог-Сервис ФНС России в Республик...    88
...        ...                                                ...   ...
23496  1441774                                              МарКо    88
23497  4718575                                      MKomov Studio    73
23498  3702770                                  АКИБ Ипотека-банк  2759
23499  5636092                                        ГИМ-КЛИНИКА    99
23500  2064382                                             Рыббла   104

[23501 rows x 3 columns]

In [63]:
employers.shape[0] # количество строк датасета работадателей

23501

3. Считаем с помощью запроса количество регионов (таблица areas).

In [14]:
query_3_1 = f'''select *
           from areas
        '''
areas = pd.read_sql_query(query_3_1, connection) # датасет регионов

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_3451/3640107649.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  areas = pd.read_sql_query(query_3_1, connection) # датасет регионов

In [15]:
areas

        id              name
0     2758           Тбилиси
1        8            Майкоп
2     1180          Нерюнгри
3     1240       Новокузнецк
4        2   Санкт-Петербург
...    ...               ...
1357  5043  Звёздный Городок
1358  3934       Воротынск\n
1359  4825             Чемал
1360  3708         Усть-Нера
1361  2432         Каневская

[1362 rows x 2 columns]

In [65]:
areas.shape[0] # количество строк датасета регионов

1362

4. Считаем с помощью запроса количество сфер деятельности в базе (таблица industries).

In [16]:
query_3_1 = f'''select *
           from industries
        '''
industries = pd.read_sql_query(query_3_1, connection) # датасет сфер работы

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_3451/2082876554.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  industries = pd.read_sql_query(query_3_1, connection) # датасет сфер работы

In [17]:
industries

          id                                               name
0      7.540                Разработка программного обеспечения
1      7.539  Системная интеграция,  автоматизации технологи...
2     27.550              Безалкогольные напитки (производство)
3     27.551  Безалкогольные напитки (продвижение, оптовая т...
4     13.664             Управление и эксплуатация недвижимости
..       ...                                                ...
289   37.626             Ассоциация в сфере культуры, искусства
290   42.603                              Табак  (производство)
291   29.532                           Рыболовство, рыбоводство
292   37.627                      Благотворительная организация
293  388.505  Оборудование для деревообработки, заготовки ле...

[294 rows x 2 columns]

In [67]:
industries.shape[0] # количество строк датасета сфер работы

294

***

In [68]:
# У нас есть 21223 разных вакансий, и дальше идет на уменьшение.
# В целом за этот юнит посмотрели на количество строк таблиц.
# Посмотрели на строение данных какие есть признаки

# Детальный анализ вакансий

1. Запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Сортируем по количеству вакансий в порядке убывания.

In [69]:
query = f'''
select 
    a.name, /*вывели название региона*/
    count(v.id) as cnt /*подсчитали кол-во вакансий*/
from vacancies as v join areas as a on v.area_id = a.id /*сджойнили таблицы региона и вакансий*/
group by a.id /*делаем группировку по региону*/
order by 2 desc /*сортируем*/
limit 5 /*и выводим первые 5*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/4245763863.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [70]:
result['name'].to_list()

['Москва', 'Санкт-Петербург', 'Минск', 'Новосибирск', 'Алматы']

2. Запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [71]:
query = f'''
select count(*)
from vacancies
where (salary_from is not null) or (salary_to is not null)
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/3513706874.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [72]:
result.iloc[0, 0] # Это означает что есть 24073 вакансий в которых указана либо вилка зп,
#либо максимум которые они могут платить

24073

3. Находим средние значения для нижней и верхней границы зарплатной вилки. Округляем значения до целого.

In [73]:
query = f'''
select 
    avg(salary_from) as mean_salary_from,
    avg(salary_to) as mean_salary_to
from vacancies
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/2068149341.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [74]:
print(result.iloc[0, 0].round()) # средняя вилка 
print(result.iloc[0, 1].round()) # средний пик

71065.0
110537.0

4. Запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат сортируем по убыванию количества.

In [75]:
query = f'''
select 
    v.schedule, /*выводим тип графика*/
    v.employment, /*тип занятости*/
    count(v.id) as cnt /*считаем количество сгруппированных вакансий*/
from vacancies as v
group by v.schedule, v.employment /*группируем по двум признакам*/
order by 3 desc /*сортируем по количеству вакансий*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/4155628635.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [76]:
result # выясняли что в основном работы бывают с полным днем работы и полной занятостью

            schedule           employment    cnt
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [77]:
query = f'''
select 
    experience, /*выводим опыт*/
    count(id) as cnt /*количество вакансий*/
from vacancies
group by experience /*группируем по вакансиям*/
order by 2 asc /*отсортировали по условии*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/2152615263.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [78]:
result # есть 4 вида опыта и самый малый из них "Более 6 лет" 
# это означает что большинству работадателей нужны специалисты с опытом более 1 года

           experience    cnt
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [79]:
# Можно уверенно говорить что большинство вакансий в таких городах как ('Москва', 'Санкт-Петербург', 'Минск', 'Новосибирск', 'Алматы')
# Понятие средняя вилка и средний пик очень растижимое по тому как судя по анализу 52% вакансий не указывают зп, и много зарабатывают в сфере айти, а здесь не все вакансий про айти 
# Если говорить про метод работы, безусловно выигрывает Полный день и Полная занятость. Это означает что большинство работадателей хотят себе так скажем оффлайн и постоянных специалистов
# Считаю что опыт работы особой роли не играет 
# Это мы видим по последнему заданию 
# Там много вакансий а именно 60% требуют как минимум 1 года опыта 
# А это в свою очередь говорит нам о том, что для получения оффера главное как вы себя представляете и продаете.

# Анализ работодателей

1. Запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [80]:
query = f'''
select
    e.name, /*выводим работадателя*/
    count(*) as cnt /*считаем кол-во вакансий*/
from vacancies as v 
join employers as e on v.employer_id = e.id /*соединяем таблицы по айдишкам*/
group by e.id /*группируем по работадателям*/
order by 2 desc /*отсортируем для удобного просмотра запроса*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/1203222303.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [81]:
result # В топ 5 находится компании Яндекс, Ростелеком, Тинькофф, СБЕР, Газпром нефть

                              name   cnt
0                           Яндекс  1933
1                       Ростелеком   491
2                         Тинькофф   444
3                             СБЕР   428
4                    Газпром нефть   331
...                            ...   ...
14901   Евсеев Сергей Владимирович     1
14902          Кадровые технологии     1
14903                   ЛОМБАРД 24     1
14904            Авто-Компонент ТД     1
14905  НПП «Старт» им. А.И. Яскина     1

[14906 rows x 2 columns]

2. Запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [82]:
query = f'''
select
    a.name, /*выводим название региона*/
    count(e.name) as cnt_emp, /*считаем кол-во работадателей*/
    count(v.name) as cnt_vac /*считаем кол-во вакансий*/
from areas as a 
left join vacancies as v on v.area_id = a.id /*соединяем таблицу вакансий и регионов*/
left join employers as e on e.area = a.id /*также таблицу работадателей для того чтобы посчитать кол-во*/
where v.name is null /*фильтруем чтобы вакансия была null */
group by a.name /*группируем по региону*/
order by 2 desc /*сортируем*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/2799858919.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [83]:
result # Финальная таблица выглядит так, что в регионах где нет вакансий есть работадатели(количество) 
# Как видим Россия и Казахстан лидируют

                               name  cnt_emp  cnt_vac
0                            Россия      410        0
1                         Казахстан      207        0
2                Московская область       75        0
3                Краснодарский край       19        0
4                          Беларусь       18        0
..                              ...      ...      ...
588                        Кувандык        0        0
589                        Куйбышев        0        0
590  Куйбышево (Ростовская область)        0        0
591                        Култаево        0        0
592                        Кульсары        0        0

[593 rows x 3 columns]

3. Для каждого работодателя посчитаем количество регионов, в которых он публикует свои вакансии. Сортируем результат по убыванию количества.

In [84]:
query = f'''
select 
    e.name, /*выводим работадателя*/
    count(distinct a.id) /*считаем регионы так, чтобы они не повторялись*/
from employers as e 
join vacancies as v on v.employer_id = e.id /*соединяем таблицы вакансий к таблице работадателя*/
join areas as a on a.id = v.area_id /*также соединяем таблицу регионов к таблице вакансий*/
group by e.name /*группируем для считывания*/
order by 2 desc /*сортируем для удобства анализа*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/3454997641.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [85]:
result

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
14761                  UniSol      1
14762            UNISTORY LLC      1
14763                   UNIT6      1
14764     United Distribution      1
14765              UNITEL LLC      1

[14766 rows x 2 columns]

4. Запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [86]:
query = f'''
select 
    count(*)
from employers as e 
left join employers_industries as ei on e.id = ei.employer_id
left join industries as i on i.id = ei.industry_id
where i.name is null
        '''
result = pd.read_sql_query(query, connection)
# посчитали количество работодателей, у которых не указана сфера деятельности

query_1 = f'''
select 
    e.name
from employers as e 
left join employers_industries as ei on e.id = ei.employer_id
left join industries as i on i.id = ei.industry_id
where i.name is null
        '''
        
result_1 = pd.read_sql_query(query_1, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/2982330737.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)
/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/2982330737.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result_1 = pd.read_sql_query(query_1, connection)

In [87]:
display(result) # Количество компании в которых не указана сфера деятельности
display(result_1) # И показал эти компании

   count
0   8419

                                                  name
0                                            Вертикаль
1                             Нозиков Денис Михайлович
2                МВД России по Республике Башкортостан
3                ГКУ «Центр цифровой трансформации РТ»
4     Театральный музей им. А.А. Бахрушина, ФГБУК ГЦТМ
...                                                ...
8414                                       СвязьИнформ
8415                                       ГОКУ ЦОСУМС
8416       Сыктывкарская Швейная Фабрика Текстиль Коми
8417                                    FINOM TECH LTD
8418                           Группа компаний Планета

[8419 rows x 1 columns]

5. Запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [88]:
query = f'''
select 
    e.name /*выводим название компании*/
from employers as e 
join employers_industries as ei on e.id = ei.employer_id /*соединяем таблицу о сфере деятельности с таблицой компании*/
join industries as i on i.id = ei.industry_id 
group by e.name /*группируем по названию компании*/
having count(i.name) = 4 /*фильтруем агрегат по условию*/
order by 1 /*сортируем в алфавитном порядке*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/1703309776.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [89]:
result #Это компании у которых сразу 4 сферы деятельности

                 name
0        101 Интернет
1            21vek.by
2                2ГИС
3                  2К
4         4 пикселя +
...               ...
1131            ЮРИОН
1132  ЮТИП Технологии
1133           ЯКласс
1134            ЯрНео
1135    Яшин&Партнёры

[1136 rows x 1 columns]

6. С помощью запроса выясняем, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [90]:
query = f'''
select 
    count(*) as cnt /*считеам кол-во компании*/
from employers_industries as ei 
join industries as i on ei.industry_id = i.id /*соединяем таблицу о сфера деятельности*/
where i.name = 'Разработка программного обеспечения' /*фильтруем чтобы остались только те компании, у которых сфера деятельности Разработка программного обеспечения */
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/3035293671.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [91]:
result

    cnt
0  3553

7. Для компании «Яндекс» выводим список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавляем строку Total с общим количеством вакансий компании. Результат сортируем по возрастанию количества.

Список городов-милионников [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8).

In [92]:
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
table = pd.read_html(url)[1] # сохраняем таблицу
cities = table['Город'].to_list() # конвертируем в список
cities

['Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Нижний Новгород',
 'Челябинск',
 'Красноярск',
 'Самара',
 'Уфа',
 'Ростов-на-Дону',
 'Омск',
 'Краснодар',
 'Воронеж[a]',
 'Пермь',
 'Волгоград']

In [93]:
query = f'''
select 
    a.name, /*выводим название региона*/
    count(v.id) as cnt /*кол-во вакансий*/ 
from employers as e
join vacancies as v on e.id = v.employer_id /*соединяем таблицу с вакансиями*/
join areas as a on v.area_id = a.id /*соединяем таблицу с регионами*/
where e.name = 'Яндекс' and a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')
group by a.name /*после фильтрации по регионам группируем по регионам*/

union all /*соединяем тотал снизу*/

select 
    'total', sum(cnt) as cnt 
from (
select 
    a.name,
    count(v.id) as cnt 
from employers as e
join vacancies as v on e.id = v.employer_id
join areas as a on v.area_id = a.id
where e.name = 'Яндекс' and a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград')
group by a.name ) as ds 

order by 2 /*сортируем по количеству*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/3002724477.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [94]:
result # в Москве больше всего вакансии от компании Яндекс

               name    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7            Самара   26.0
8               Уфа   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            total  485.0

***

In [95]:
# Основные компании это Яндекс, Тинькофф, Ростелеком СБЕР итд
# Больше всего вакансии в регионах как Москва, Алмата

# Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

In [96]:
query = f'''
select 
    count(*) /*считаем вакансий*/
from vacancies as v
where lower(v.name) like '%data%' or lower(v.name) like '%данн%' /*фильтруем по условию*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/1035406425.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [97]:
result # 1771 вакансий связанные данными

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'


Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [98]:
query = f'''
WITH vac AS( /*сделали таблицу для Дата Сайнтиста*/
SELECT * 
FROM vacancies
WHERE 
    lower(name) LIKE '%data scientist%' OR
    lower(name) LIKE '%data science%' OR
    lower(name) LIKE '%исследователь данных%' OR
    name like '%ML%' and name not like '%HTML%' OR
    lower(name) LIKE '%machine learning%' OR
    lower(name) LIKE '%машинн%обучен%'
    )
                
SELECT count(*)
FROM vac
WHERE /*вакансия считается для Джуна*/
    lower(name) LIKE '%junior%' OR /*если в названиях вакансий есть слово junior*/
    experience = 'Нет опыта' OR /*если опыт работы нет*/
    employment = 'Стажировка' /*и если тип работы стажировка*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/2401886201.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [99]:
result # есть 51 вакансии для Джунов

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

In [100]:
query = f'''
WITH vac AS(
SELECT * 
FROM vacancies
WHERE 
    lower(name) LIKE '%data scientist%' OR
    lower(name) LIKE '%data science%' OR
    lower(name) LIKE '%исследователь данных%' OR
    name like '%ML%' and name not like '%HTML%' OR
    lower(name) LIKE '%machine learning%' OR
    lower(name) LIKE '%машинн%обучен%'
    )
                
SELECT count(*)
FROM vac
WHERE
    key_skills like '%SQL%' OR /*если в ключевых навыках есть слово SQL */
    lower(key_skills) like '%postgres%' /*либо есть слово postgres */
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/1961850597.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [101]:
result #есть 201 вакансии для дата сайнтистов которые требуют знания SQL

   count
0    201

4. Проверяем, насколько популярен Python в требованиях работодателей к DS.Для этого вычисляем количество вакансий, в которых в качестве ключевого навыка указан Python.

In [102]:
query = f'''
WITH vac AS(
SELECT * 
FROM vacancies
WHERE 
    lower(name) LIKE '%data scientist%' OR
    lower(name) LIKE '%data science%' OR
    lower(name) LIKE '%исследователь данных%' OR
    name like '%ML%' and name not like '%HTML%' OR
    lower(name) LIKE '%machine learning%' OR
    lower(name) LIKE '%машинн%обучен%'
    )
                
SELECT count(*)
FROM vac
WHERE
    lower(key_skills) like '%python%' /*если в вакансиях есть слово python*/
        '''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/1425528177.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [103]:
result # есть 351 вакансий для дата сайнтистов которые требуют знания python

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?

In [104]:
query = f'''
select 
    round(avg(length(key_skills) - length(replace(key_skills, CHR(9), '')) + 1), 2) /*находим среднее кол-во ключевых навыков*/
from vacancies /*от длины ключевых навыков минусуем пробелы*/
where 
    lower(name) LIKE '%data scientist%' OR
    lower(name) LIKE '%data science%' OR
    lower(name) LIKE '%исследователь данных%' OR
    name like '%ML%' and name not like '%HTML%' OR
    lower(name) LIKE '%machine learning%' OR
    lower(name) LIKE '%машинн%обучен%' and
    key_skills is not NULL /*обязательно чтобы ключевой навык не был пустым*/
'''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/798123287.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [105]:
result # в среднем в ключевых навыках есть 6-7 букв

   round
0   6.41

6. Запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 




Выясняем, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлим до целого числа.

In [106]:
query = f'''
with salary as (select 
    experience,
    (salary_from + salary_to) / 2 as salary
from vacancies
where 
    (lower(name) LIKE '%data scientist%' OR
    lower(name) LIKE '%data science%' OR
    lower(name) LIKE '%исследователь данных%' OR
    name like '%ML%' and name not like '%HTML%' OR
    lower(name) LIKE '%machine learning%' OR
    lower(name) LIKE '%машинн%обучен%')
    and (salary_from is not null and salary_to is not null)

/*сначала создаем таблицу где указаны и минимальную зп и максимальную зп */

union all

select 
    experience,
    salary_to
from vacancies
where 
    (lower(name) LIKE '%data scientist%' OR
    lower(name) LIKE '%data science%' OR
    lower(name) LIKE '%исследователь данных%' OR
    name like '%ML%' and name not like '%HTML%' OR
    lower(name) LIKE '%machine learning%' OR
    lower(name) LIKE '%машинн%обучен%')
    and (salary_from is null and salary_to is not null)

/*дальше соединяем таблицу снизу в которой есть максимальная зп но нет минимальной зп*/

union all

select 
    experience,
    salary_from 
from vacancies
where 
    (lower(name) LIKE '%data scientist%' OR
    lower(name) LIKE '%data science%' OR
    lower(name) LIKE '%исследователь данных%' OR
    name like '%ML%' and name not like '%HTML%' OR
    lower(name) LIKE '%machine learning%' OR
    lower(name) LIKE '%машинн%обучен%')
    and (salary_from is not null and salary_to is null)
    )
    
/*затем соединяем таблицу где есть минимальная зп но без максимальной зп*/
    
select 
    experience, /*выводим опыт работы*/
    round(avg(salary)) as average_salary /*выводим среднюю зп в зависимости от опыта*/
from salary
group by experience /*группируем опыт работы*/

'''
result = pd.read_sql_query(query, connection)

/var/folders/59/0_8dknjn20d4xpxm3dm1fngr0000gn/T/ipykernel_1324/3402317610.py:56: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  result = pd.read_sql_query(query, connection)

In [107]:
result # результат

           experience  average_salary
0       От 3 до 6 лет        243115.0
1  От 1 года до 3 лет        139675.0
2           Нет опыта         74643.0

***

# Общий вывод по проекту

In [109]:
# Эти даннын являются не подмеченными, то есть нельзя обучить модель линейной регрессии.